package ir.rezarasoulzadeh.zekraneh.service.utils

class Prays {

    fun getPrays(day : String) : String {
        return when (day) {
            "1" -> "یا ذُوالجَلالِ وَ الاِکرام"
            "2" -> "یا قاضیَ الحاجات"
            "3" -> "یا اَرحَمَ الرّاحِمین"
            "4" -> "یا حَیُّ یا قَیّوم "
            "5" -> "لا اِلهَ الَّا اَللهُ المَلِکُ الحَقُّ المُبین"
            "6" -> "اَللهُمَ صَلِّ عَلی مُحَمَّدٍ وَ آلِ مُحَمَّد"
            "7" -> "یا رَبَّ العالَمین"
            else -> "اَللهُمَ صَلِّ عَلی مُحَمَّدٍ وَ آلِ مُحَمَّد"
        }
    }

}